## Cross dataset analysis

#### Create reference tables for first cross query

In [13]:
%%bigquery
create or replace table hrsa_modeled.temp_table1 as
select distinct state, sum(confirmed) as confirmed, sum(recovered) as recovered
from covid_19_modeled.event e join covid_19_modeled.location l
on e.location_id = l.id
where last_update BETWEEN '2020-02-01 00:00:00' AND '2020-02-29 23:59:59'
group by state
order by confirmed desc

Empty DataFrame
Columns: []
Index: []

In [20]:
%%bigquery
create or replace table hrsa_modeled.temp_table2 as
select distinct l.id as id_num, state_abbr, county_equiv_name, max(hpsa_score) as score
from hrsa_modeled.location l join hrsa_modeled.shortage_area_detail d
on l.id = d.id
group by id_num, state_abbr, county_equiv_name
order by score desc

Empty DataFrame
Columns: []
Index: []

#### This query returns hpsa_score, confirmed, and recovered for each state by descending order number of confirmed cases for the month of february

In [25]:
%%bigquery
create or replace table hrsa_modeled.cross_ds1 as
select distinct c.state as state, sum(confirmed) as confirmed, recovered, score
from (
hrsa_modeled.temp_table1 c left outer join hrsa_modeled.temp_table2 a
on c.state=a.state_abbr)
group by state, recovered, score
order by confirmed desc

Empty DataFrame
Columns: []
Index: []

In [27]:
%%bigquery
select *
from hrsa_modeled.cross_ds1
limit 5

                                         state  confirmed  recovered  score
0  Unassigned Location (From Diamond Princess)        158          0    NaN
1                                           CA         29          3    NaN
2                   NE (From Diamond Princess)         11          0    NaN
3                                           NE         11          0    NaN
4                                           WA         10          2    NaN

In [44]:
%%bigquery
create or replace view hrsa_modeled.v_cross_score_feb_state as
select distinct c.state as state, sum(confirmed) as confirmed, recovered, score
from (
`extracredit-276620.hrsa_modeled.temp_table1` c left outer join `extracredit-276620.hrsa_modeled.temp_table2` a
on c.state=a.state_abbr)
group by state, recovered, score
order by confirmed desc

Empty DataFrame
Columns: []
Index: []

#### Create reference table for second cross query

In [21]:
%%bigquery
create or replace table hrsa_modeled.temp_table3 as
select distinct state, sum(confirmed) as confirmed, sum(recovered) as recovered
from covid_19_modeled.event e join covid_19_modeled.location l
on e.location_id = l.id
where last_update BETWEEN '2020-03-01 00:00:00' AND '2020-03-31 23:59:59'
group by state
order by confirmed desc

Empty DataFrame
Columns: []
Index: []

#### This query returns hpsa_score, confirmed, and recovered for each state by descending order number of confirmed cases for the month of march

In [28]:
%%bigquery
create or replace table hrsa_modeled.cross_ds2 as
select distinct c.state as state, sum(confirmed) as confirmed, recovered, score
from (
hrsa_modeled.temp_table3 c left outer join hrsa_modeled.temp_table2 a
on c.state=a.state_abbr)
group by state, recovered, score
order by confirmed desc

Empty DataFrame
Columns: []
Index: []

In [29]:
%%bigquery
select *
from hrsa_modeled.cross_ds2
limit 5

  state  confirmed  recovered  score
0    NY  516860283          0      0
1    NY  159162810          0     19
2    NY  126771782          0     16
3    NY  116719394          0     15
4    NY  110297035          0     11

In [45]:
%%bigquery
create or replace view hrsa_modeled.v_cross_score_mar_state as
select distinct c.state as state, sum(confirmed) as confirmed, recovered, score
from (
`extracredit-276620.hrsa_modeled.temp_table3` c left outer join `extracredit-276620.hrsa_modeled.temp_table2` a
on c.state=a.state_abbr)
group by state, recovered, score
order by confirmed desc

Empty DataFrame
Columns: []
Index: []

#### Create reference table for third cross query

In [23]:
%%bigquery
create or replace table hrsa_modeled.temp_table4 as
select distinct state, sum(confirmed) as confirmed, sum(recovered) as recovered
from covid_19_modeled.event e join covid_19_modeled.location l
on e.location_id = l.id
where last_update BETWEEN '2020-04-01 00:00:00' AND '2020-04-30 23:59:59'
group by state
order by confirmed desc

Empty DataFrame
Columns: []
Index: []

#### This query returns hpsa_score, confirmed, and recovered for each state by descending order number of confirmed cases for the month of april

In [30]:
%%bigquery
create or replace table hrsa_modeled.cross_ds3 as
select distinct c.state as state, sum(confirmed) as confirmed, recovered, score
from (
hrsa_modeled.temp_table4 c left outer join hrsa_modeled.temp_table2 a
on c.state=a.state_abbr)
group by state, recovered, score
order by confirmed desc

Empty DataFrame
Columns: []
Index: []

In [31]:
%%bigquery
select *
from hrsa_modeled.cross_ds3
limit 5

  state   confirmed  recovered  score
0    NY  6399860265          0      0
1    NY  1970783550          0     19
2    NY  1569711810          0     16
3    NY  1445241270          0     15
4    NY  1365718425          0     11

In [46]:
%%bigquery
create or replace view hrsa_modeled.v_cross_score_apr_state as
select distinct c.state as state, sum(confirmed) as confirmed, recovered, score
from (
`extracredit-276620.hrsa_modeled.temp_table4` c left outer join `extracredit-276620.hrsa_modeled.temp_table2` a
on c.state=a.state_abbr)
group by state, recovered, score
order by confirmed desc

Empty DataFrame
Columns: []
Index: []